In [1]:
import pandas as pd # importing pandas library

## Reading html file into list

In [2]:
data_list= pd.read_html('https://www.genealogybranches.com/censuscosts.html')

## number of HTML tables

In [3]:
len(data_list)

2

## Loading into data frames

In [4]:
df1=data_list[0]
df1.head()

             0                 1            2                        3
0  Census Year  Total Population  Census Cost  Average Cost Per Person
1         1790           3929214      $44,377               1.13 cents
2         1800           5308483      $66,109               1.24 cents
3         1810           7239881     $178,445               2.46 cents
4         1820           9633822     $208,526               2.16 cents

In [5]:
df2=data_list[1]
df2.head()

                                                   0
0  The U.S. population reached 300,000,000 on 17 ...

## After exploring briefly, df1 contains required data

## Performing various operations to adjust the data frame into valid structute of rows and columns

In [6]:
df1.columns

Int64Index([0, 1, 2, 3], dtype='int64')

In [7]:
rows=df1.iloc[0]
rows

0                Census Year
1           Total Population
2                Census Cost
3    Average Cost Per Person
Name: 0, dtype: object

In [8]:
df1.columns=rows
df1.head()

0  Census Year  Total Population  Census Cost  Average Cost Per Person
0  Census Year  Total Population  Census Cost  Average Cost Per Person
1         1790           3929214      $44,377               1.13 cents
2         1800           5308483      $66,109               1.24 cents
3         1810           7239881     $178,445               2.46 cents
4         1820           9633822     $208,526               2.16 cents

In [9]:
df1=df1.drop(df1.index[0])

In [10]:
df1.head()

0 Census Year Total Population Census Cost Average Cost Per Person
1        1790          3929214     $44,377              1.13 cents
2        1800          5308483     $66,109              1.24 cents
3        1810          7239881    $178,445              2.46 cents
4        1820          9633822    $208,526              2.16 cents
5        1830         12866020    $378,545              2.94 cents

In [11]:
df1.tail()

0  Census Year Total Population     Census Cost Average Cost Per Person
19        1970        203302031    $247,653,000                   $1.22
20        1980        226542199  $1,078,488,000                   $4.76
21        1990        248718301  $2,492,830,000                  $10.02
22        2000        281421906    $4.5 Billion                  $15.99
23       2010*        308745538     $13 Billion                  $42.11

# Function that cleans the data accordingly

In [12]:
def clease_year(dataframe):
    for i in dataframe.columns:
        dataframe[i]=dataframe[i].str.replace(' ','')
        dataframe[i]=dataframe[i].str.replace('Billion','000000000')
        dataframe[i]=dataframe[i].str.replace('.','')
        dataframe[i]=dataframe[i].str.replace(',','')
        dataframe[i]=dataframe[i].str.replace('*','')
        dataframe[i]=dataframe[i].map(lambda x: x.lstrip('*$.,').rstrip('cents'))

## Applying function to our dataframe

In [13]:
clease_year(df1)

In [14]:
df1.head()

0 Census Year Total Population Census Cost Average Cost Per Person
1        1790          3929214       44377                     113
2        1800          5308483       66109                     124
3        1810          7239881      178445                     246
4        1820          9633822      208526                     216
5        1830         12866020      378545                     294

## creating a csv file

In [18]:
df1.to_csv('census_cost_cleansed.csv',index=False)

In [19]:
new_df=pd.read_csv("census_cost_cleansed.csv")

In [20]:
new_df.head()

   Census Year  Total Population  Census Cost  Average Cost Per Person
0         1790           3929214        44377                      113
1         1800           5308483        66109                      124
2         1810           7239881       178445                      246
3         1820           9633822       208526                      216
4         1830          12866020       378545                      294

In [21]:
new_df.tail()

    Census Year  Total Population  Census Cost  Average Cost Per Person
18         1970         203302031    247653000                      122
19         1980         226542199   1078488000                      476
20         1990         248718301   2492830000                     1002
21         2000         281421906  45000000000                     1599
22         2010         308745538  13000000000                     4211